# üö© DataFrameÏóê ÎåÄÌï¥ÏÑú
## Ï£ºÏöî ÌÜ†ÌîΩ
1. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Í∏∞Ï¥à
2. Îç∞Ïù¥ÌÑ∞ Ï†ëÍ∑º Î∞è Ï†úÍ±∞
3. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Í≤∞Ï∏°Í∞í
4. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Ï†ïÎ†¨Í≥º ÌïÑÌÑ∞ÎßÅ
5. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Ïª¨Îüº ÏàòÏ†ï
6. ÌåêÎã§Ïä§ Îç∞Ïù¥ÌÑ∞ ÌÉÄÏûÖ
7. Î©îÎ™®Î¶¨ ÏµúÏ†ÅÌôî
## Î™©Ìëú
- Ìñâ ÌïÑÌÑ∞ÎßÅ/Ï†ïÎ†¨, Í≤∞Ï∏°Í∞í Ï≤òÎ¶¨, ÏÉàÎ°úÏö¥ Ïª¨Îüº Ï∂îÍ∞Ä, Ïª¨ÎüºÏóê Ìï®Ïàò Ï†ÅÏö©ÌïòÍ∏∞
## Î™©Ï∞®
1. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏù¥ÎûÄ?
2. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Ï°∞Ìöå
3. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ ÏÇ≠Ï†ú/Ï§ëÎ≥µ
4. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Í≤∞Ï∏°Í∞í
5. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ ÌïÑÌÑ∞ÎßÅ
6. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Ï†ïÎ†¨
7. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Ïª¨Îüº ÏàòÏ†ï
8. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Ïª¨Îüº Ï∂îÍ∞Ä
9. map Î©îÏÑúÎìú
10. assign Î©îÏÑúÎìú
11. Îç∞Ïù¥ÌÑ∞ ÌÉÄÏûÖ

In [1]:
import numpy as np
import pandas as pd

## 1. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏù¥ÎûÄ?
- Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùò Ïó¥ÏùÄ ÌïòÎÇòÏùò SeriesÏù¥Îã§
    - Í∞Å Ïª¨ÎüºÏùÄ ÎèôÏùºÌïú Ìñâ Ïù∏Îç±Ïä§Î•º Í≥µÏú†ÌïúÎã§.
    - Í∞Å Ïª¨ÎüºÎ™Ö = column index. Series name ÏÜçÏÑ±Í∞íÏùÑ Ìè¨Ìï®ÌïúÎã§.
### > Ï£ºÏöî ÏÜçÏÑ±
1. shape
2. index (Ìñâ Ïù∏Îç±Ïä§)
3. columns
4. axes (ÌñâÍ≥º Ïó¥Ïùò Ïù∏Îç±Ïä§)
5. dtypes (Í∞Å SeriesÏùò Îç∞Ïù¥ÌÑ∞ ÌÉÄÏûÖ)

In [2]:
oil = pd.read_csv('./data/retail/oil.csv')
oil

            date  dcoilwtico
0     2013-01-01         NaN
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1218 rows x 2 columns]

In [3]:
oil.shape

(1218, 2)

In [4]:
oil.axes

[RangeIndex(start=0, stop=1218, step=1),
 Index(['date', 'dcoilwtico'], dtype='object')]

In [5]:
oil.index

RangeIndex(start=0, stop=1218, step=1)

In [6]:
oil.columns

Index(['date', 'dcoilwtico'], dtype='object')

In [7]:
oil.columns = ['price_date', 'oil_price']
oil.head()

   price_date  oil_price
0  2013-01-01        NaN
1  2013-01-02      93.14
2  2013-01-03      92.97
3  2013-01-04      93.12
4  2013-01-07      93.20

### > Ï£ºÏöî Î©îÏÑúÎìú
1. head, tail
2. sample (ÏûÑÏùòÏùò Ìñâ Îç∞Ïù¥ÌÑ∞ Ï∂îÏ∂ú)
3. info (Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Í∏∞Î≥∏ Ï†ïÎ≥¥)
4. describe (Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùò ÌÜµÍ≥Ñ Ï†ïÎ≥¥; ONLY numeric columns BY DEFAULT)

In [8]:
oil.head()

   price_date  oil_price
0  2013-01-01        NaN
1  2013-01-02      93.14
2  2013-01-03      92.97
3  2013-01-04      93.12
4  2013-01-07      93.20

In [9]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price_date  1218 non-null   object
 1   oil_price   1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [10]:
oil.describe()

         oil_price
count  1175.000000
mean     67.714366
std      25.630476
min      26.190000
25%      46.405000
50%      53.190000
75%      95.660000
max     110.620000

In [11]:
oil.describe(include='all')

        price_date    oil_price
count         1218  1175.000000
unique        1218          NaN
top     2013-01-01          NaN
freq             1          NaN
mean           NaN    67.714366
std            NaN    25.630476
min            NaN    26.190000
25%            NaN    46.405000
50%            NaN    53.190000
75%            NaN    95.660000
max            NaN   110.620000

## 2. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Ï°∞Ìöå
### > Îã®Ïùº Ïª¨Îüº Ï°∞Ìöå
- ÎåÄÍ¥ÑÌò∏Î•º ÏÇ¨Ïö©ÌïúÎã§
### > Î≥µÏàò Ïª¨Îüº Ï°∞Ìöå
- ÎåÄÍ¥ÑÌò∏Î•º ÏÇ¨Ïö©ÌïúÎã§
### > ‚úÖ Pro Tips
1. 1Í∞ú Ïù¥ÏÉÅÏùò Ïª¨ÎüºÏùÑ Ï°∞ÌöåÌïòÎäî Í≤ΩÏö∞ÏóêÎäî loc Ï†ëÍ∑ºÏûêÎ•º ÏÇ¨Ïö©ÌïòÎäî Ìé∏Ïù¥ Í∂åÏû•ÎêúÎã§.
    - ÎåÄÍ¥ÑÌò∏Îäî ÏÉàÎ°úÏö¥ Ïª¨ÎüºÏùÑ ÏÉùÏÑ±ÌïòÍ±∞ÎÇò Îπ†Î•∏ ÌôïÏù∏Ïù¥ ÌïÑÏöîÌï† ÎïåÎßå ÏÇ¨Ïö©ÌïúÎã§.

In [12]:
oil.columns = ['date', 'price']
oil.head()

         date  price
0  2013-01-01    NaN
1  2013-01-02  93.14
2  2013-01-03  92.97
3  2013-01-04  93.12
4  2013-01-07  93.20

In [13]:
oil['price'].head()

0      NaN
1    93.14
2    92.97
3    93.12
4    93.20
Name: price, dtype: float64

In [14]:
type(oil['price'])

pandas.core.series.Series

In [15]:
type(oil[['price']])

pandas.core.frame.DataFrame

In [16]:
oil[['price', 'date']]

      price        date
0       NaN  2013-01-01
1     93.14  2013-01-02
2     92.97  2013-01-03
3     93.12  2013-01-04
4     93.20  2013-01-07
...     ...         ...
1213  47.65  2017-08-25
1214  46.40  2017-08-28
1215  46.46  2017-08-29
1216  45.96  2017-08-30
1217  47.26  2017-08-31

[1218 rows x 2 columns]

### > iloc Ï†ëÍ∑ºÏûê
- Position-based
- [Ìñâ, Ïó¥]
### > loc Ï†ëÍ∑ºÏûê
- Label-based
- [Ìñâ, Ïó¥]

In [17]:
oil['euro_price'] = oil['price'] * 1.1
oil.head()

         date  price  euro_price
0  2013-01-01    NaN         NaN
1  2013-01-02  93.14     102.454
2  2013-01-03  92.97     102.267
3  2013-01-04  93.12     102.432
4  2013-01-07  93.20     102.520

In [18]:
oil.iloc[:3, :]

         date  price  euro_price
0  2013-01-01    NaN         NaN
1  2013-01-02  93.14     102.454
2  2013-01-03  92.97     102.267

In [19]:
oil.iloc[:3, -1]

0        NaN
1    102.454
2    102.267
Name: euro_price, dtype: float64

In [20]:
oil.iloc[:3, -2:]

   price  euro_price
0    NaN         NaN
1  93.14     102.454
2  92.97     102.267

In [21]:
oil.loc[:5, :]

         date  price  euro_price
0  2013-01-01    NaN         NaN
1  2013-01-02  93.14     102.454
2  2013-01-03  92.97     102.267
3  2013-01-04  93.12     102.432
4  2013-01-07  93.20     102.520
5  2013-01-08  93.21     102.531

In [22]:
oil.loc[:3, 'date']

0    2013-01-01
1    2013-01-02
2    2013-01-03
3    2013-01-04
Name: date, dtype: object

In [23]:
oil.loc[:3, ['date', 'euro_price']]

         date  euro_price
0  2013-01-01         NaN
1  2013-01-02     102.454
2  2013-01-03     102.267
3  2013-01-04     102.432

In [24]:
oil.loc[:3, ['euro_price', 'date']]

   euro_price        date
0         NaN  2013-01-01
1     102.454  2013-01-02
2     102.267  2013-01-03
3     102.432  2013-01-04

In [25]:
oil.loc[:3, 'date':'price']

         date  price
0  2013-01-01    NaN
1  2013-01-02  93.14
2  2013-01-03  92.97
3  2013-01-04  93.12

## 3. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ ÏÇ≠Ï†ú/Ï§ëÎ≥µ
### > drop Î©îÏÑúÎìú
- axis=0 (drop rows by label)
- axis=1 (drop columns)

In [26]:
oil.head()

         date  price  euro_price
0  2013-01-01    NaN         NaN
1  2013-01-02  93.14     102.454
2  2013-01-03  92.97     102.267
3  2013-01-04  93.12     102.432
4  2013-01-07  93.20     102.520

In [27]:
oil_euro = oil.drop('price', axis=1)
oil_euro.head()

         date  euro_price
0  2013-01-01         NaN
1  2013-01-02     102.454
2  2013-01-03     102.267
3  2013-01-04     102.432
4  2013-01-07     102.520

In [28]:
oil_0_off = oil.drop(0, axis=0)
oil_0_off.head()

         date  price  euro_price
1  2013-01-02  93.14     102.454
2  2013-01-03  92.97     102.267
3  2013-01-04  93.12     102.432
4  2013-01-07  93.20     102.520
5  2013-01-08  93.21     102.531

In [29]:
oil_0_off.reset_index(drop=True)

            date  price  euro_price
0     2013-01-02  93.14     102.454
1     2013-01-03  92.97     102.267
2     2013-01-04  93.12     102.432
3     2013-01-07  93.20     102.520
4     2013-01-08  93.21     102.531
...          ...    ...         ...
1212  2017-08-25  47.65      52.415
1213  2017-08-28  46.40      51.040
1214  2017-08-29  46.46      51.106
1215  2017-08-30  45.96      50.556
1216  2017-08-31  47.26      51.986

[1217 rows x 3 columns]

### > duplicated Î©îÏÑúÎìú
- Ï§ëÎ≥µÎêú Ìñâ Í≤ÄÏÉâ (Ï§ëÎ≥µÏù¥Î©¥ TrueÎ•º Î¶¨ÌÑ¥)
- duplicated(subset=None, keep='first')
    - subset (specifies columns)
### > drop_duplicates Î©îÏÑúÎìú
- Ï§ëÎ≥µÎêú ÌñâÏùÑ Ï†úÍ±∞ÌïòÍ≥† ÏÉàÎ°úÏö¥ Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùÑ Î¶¨ÌÑ¥

In [30]:
items = pd.DataFrame({
    'product': ['Dairy', 'Dairy', 'Dairy', 'Vegetables', 'Fruits'],
    'price': [2.56, 2.56, 4.55, 2.74, 5.44]
})
items

      product  price
0       Dairy   2.56
1       Dairy   2.56
2       Dairy   4.55
3  Vegetables   2.74
4      Fruits   5.44

In [31]:
items.duplicated()

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [32]:
items.drop_duplicates(subset='product', keep='last', ignore_index=True)

      product  price
0       Dairy   4.55
1  Vegetables   2.74
2      Fruits   5.44

In [33]:
oil.loc[len(oil)] = oil.iloc[-1]
oil.tail()

            date  price  euro_price
1214  2017-08-28  46.40      51.040
1215  2017-08-29  46.46      51.106
1216  2017-08-30  45.96      50.556
1217  2017-08-31  47.26      51.986
1218  2017-08-31  47.26      51.986

In [34]:
oil.shape

(1219, 3)

In [35]:
# DataFrame.nunique(axis=0, dropna=True)
oil.nunique(dropna=False)

date          1218
price          999
euro_price     999
dtype: int64

In [36]:
oil.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1214    False
1215    False
1216    False
1217    False
1218     True
Length: 1219, dtype: bool

In [37]:
oil.duplicated(subset='price').sum()

220

In [38]:
oil.drop_duplicates(keep='last')

            date  price  euro_price
0     2013-01-01    NaN         NaN
1     2013-01-02  93.14     102.454
2     2013-01-03  92.97     102.267
3     2013-01-04  93.12     102.432
4     2013-01-07  93.20     102.520
...          ...    ...         ...
1213  2017-08-25  47.65      52.415
1214  2017-08-28  46.40      51.040
1215  2017-08-29  46.46      51.106
1216  2017-08-30  45.96      50.556
1218  2017-08-31  47.26      51.986

[1218 rows x 3 columns]

In [39]:
oil.drop_duplicates(keep='last', ignore_index=True)

            date  price  euro_price
0     2013-01-01    NaN         NaN
1     2013-01-02  93.14     102.454
2     2013-01-03  92.97     102.267
3     2013-01-04  93.12     102.432
4     2013-01-07  93.20     102.520
...          ...    ...         ...
1213  2017-08-25  47.65      52.415
1214  2017-08-28  46.40      51.040
1215  2017-08-29  46.46      51.106
1216  2017-08-30  45.96      50.556
1217  2017-08-31  47.26      51.986

[1218 rows x 3 columns]

## 4. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Í≤∞Ï∏°Í∞í
### > isna, sum Î©îÏÑúÎìú

In [40]:
products = pd.DataFrame({
    'product': [np.nan, 'Dairy', 'Dairy', np.nan, 'Fruits'],
    'price': [2.56, np.nan, 4.55, 2.74, np.nan],
    'product_id': [1, 2, 3, 4, 5]
})

products

  product  price  product_id
0     NaN   2.56           1
1   Dairy    NaN           2
2   Dairy   4.55           3
3     NaN   2.74           4
4  Fruits    NaN           5

In [41]:
# Í≤∞Ï∏°Í∞í Í∞úÏàò Ïπ¥Ïö¥ÌåÖ
products.isna().sum()

product       2
price         2
product_id    0
dtype: int64

In [42]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   product     3 non-null      object
 1   price       3 non-null      float64
 2   product_id  5 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

### > dropna Î©îÏÑúÎìú
### > fillna Î©îÏÑúÎìú

In [43]:
products

  product  price  product_id
0     NaN   2.56           1
1   Dairy    NaN           2
2   Dairy   4.55           3
3     NaN   2.74           4
4  Fruits    NaN           5

In [44]:
products.fillna({'price': 0})

  product  price  product_id
0     NaN   2.56           1
1   Dairy   0.00           2
2   Dairy   4.55           3
3     NaN   2.74           4
4  Fruits   0.00           5

In [45]:
products.dropna()

  product  price  product_id
2   Dairy   4.55           3

In [46]:
products.dropna(subset='price')

  product  price  product_id
0     NaN   2.56           1
2   Dairy   4.55           3
3     NaN   2.74           4

## 5. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ ÌïÑÌÑ∞ÎßÅ
- loc Ï†ëÍ∑ºÏûê ÏÇ¨Ïö© Í∞ÄÎä•

In [47]:
oil = pd.read_csv('./data/retail/oil.csv')
oil['benchmark'] = 100
oil.head()

         date  dcoilwtico  benchmark
0  2013-01-01         NaN        100
1  2013-01-02       93.14        100
2  2013-01-03       92.97        100
3  2013-01-04       93.12        100
4  2013-01-07       93.20        100

In [48]:
oil[oil['dcoilwtico'] > 100]

           date  dcoilwtico  benchmark
131  2013-07-03      101.92        100
133  2013-07-05      103.09        100
134  2013-07-08      103.03        100
135  2013-07-09      103.46        100
136  2013-07-10      106.41        100
..          ...         ...        ...
407  2014-07-24      102.76        100
408  2014-07-25      105.23        100
409  2014-07-28      105.68        100
410  2014-07-29      104.91        100
411  2014-07-30      104.29        100

[182 rows x 3 columns]

In [49]:
mask = ((oil['dcoilwtico'] > oil['benchmark'])
       & (oil['date'].str[:4] == '2013'))
oil[mask]

           date  dcoilwtico  benchmark
131  2013-07-03      101.92        100
133  2013-07-05      103.09        100
134  2013-07-08      103.03        100
135  2013-07-09      103.46        100
136  2013-07-10      106.41        100
..          ...         ...        ...
204  2013-10-14      102.46        100
205  2013-10-15      101.15        100
206  2013-10-16      102.34        100
207  2013-10-17      100.72        100
208  2013-10-18      100.87        100

[76 rows x 3 columns]

### > ‚úÖ Pro Tips
- query Î©îÏÑúÎìú
    - Î≥ÄÏàòÎäî '@' Í∏∞Ìò∏Î°ú Ï†ëÍ∑ºÏù¥ Í∞ÄÎä•

In [50]:
oil = pd.read_csv('./data/retail/oil.csv', parse_dates=['date'])
oil.head()

        date  dcoilwtico
0 2013-01-01         NaN
1 2013-01-02       93.14
2 2013-01-03       92.97
3 2013-01-04       93.12
4 2013-01-07       93.20

In [51]:
oil['benchmark'] = 100
oil.query(
    'dcoilwtico > benchmark and date.dt.year == 2013' 
)

          date  dcoilwtico  benchmark
131 2013-07-03      101.92        100
133 2013-07-05      103.09        100
134 2013-07-08      103.03        100
135 2013-07-09      103.46        100
136 2013-07-10      106.41        100
..         ...         ...        ...
204 2013-10-14      102.46        100
205 2013-10-15      101.15        100
206 2013-10-16      102.34        100
207 2013-10-17      100.72        100
208 2013-10-18      100.87        100

[76 rows x 3 columns]

## 6. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Ï†ïÎ†¨
### > sort_index Î©îÏÑúÎìú
- axis=0 (row index Ï†ïÎ†¨)
- axis=1 (column name Ï†ïÎ†¨)
### > sort_values Î©îÏÑúÎìú
- Î≥µÏàò Ïª¨Îüº Ï†ïÎ†¨ (ÎåÄÍ¥ÑÌò∏ ÏÇ¨Ïö©)

In [52]:
oil.head()

        date  dcoilwtico  benchmark
0 2013-01-01         NaN        100
1 2013-01-02       93.14        100
2 2013-01-03       92.97        100
3 2013-01-04       93.12        100
4 2013-01-07       93.20        100

In [53]:
oil.sort_index(ascending=False)

           date  dcoilwtico  benchmark
1217 2017-08-31       47.26        100
1216 2017-08-30       45.96        100
1215 2017-08-29       46.46        100
1214 2017-08-28       46.40        100
1213 2017-08-25       47.65        100
...         ...         ...        ...
4    2013-01-07       93.20        100
3    2013-01-04       93.12        100
2    2013-01-03       92.97        100
1    2013-01-02       93.14        100
0    2013-01-01         NaN        100

[1218 rows x 3 columns]

In [54]:
oil.sort_values('dcoilwtico', ascending=False)

           date  dcoilwtico  benchmark
178  2013-09-06      110.62        100
171  2013-08-28      110.17        100
179  2013-09-09      109.62        100
170  2013-08-27      109.11        100
182  2013-09-12      108.72        100
...         ...         ...        ...
1079 2017-02-20         NaN        100
1118 2017-04-14         NaN        100
1149 2017-05-29         NaN        100
1174 2017-07-03         NaN        100
1175 2017-07-04         NaN        100

[1218 rows x 3 columns]

In [55]:
oil['month'] = oil['date'].astype('datetime64[ns]').dt.month
oil.sort_values(['month', 'dcoilwtico'], ascending=[True, False])

           date  dcoilwtico  benchmark  month
282  2014-01-30       98.25        100      1
21   2013-01-30       97.98        100      1
22   2013-01-31       97.65        100      1
20   2013-01-29       97.62        100      1
283  2014-01-31       97.55        100      1
...         ...         ...        ...    ...
774  2015-12-21       34.55        100     12
256  2013-12-25         NaN        100     12
517  2014-12-25         NaN        100     12
778  2015-12-25         NaN        100     12
1039 2016-12-26         NaN        100     12

[1218 rows x 4 columns]

## 7. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Ïª¨Îüº ÏàòÏ†ï
### > Ïª¨ÎüºÎ™Ö Î≥ÄÍ≤Ω
1. columns ÏÜçÏÑ±
2. rename Î©îÏÑúÎìú
### > Ïª¨Îüº Ïû¨Ï†ïÎ†¨
- reindex Î©îÏÑúÎìú
    - labels, axis

## 8. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Ïª¨Îüº Ï∂îÍ∞Ä
### > ÏÇ∞Ïà†/ÎπÑÍµê Ïó∞ÏÇ∞Ïûê
- create columns with arithmetic by assigning them Series operations (ÏÇ∞Ïà†Ïó∞ÏÇ∞Ïûê)
- create BOOLEAN columns by assigning them a logical test (ÎπÑÍµêÏó∞ÏÇ∞Ïûê)

In [56]:
oil['benchmark'] = 90
oil = oil.drop('month', axis=1)
oil.head()

        date  dcoilwtico  benchmark
0 2013-01-01         NaN         90
1 2013-01-02       93.14         90
2 2013-01-03       92.97         90
3 2013-01-04       93.12         90
4 2013-01-07       93.20         90

In [57]:
oil['benchmark ratio'] = oil.loc[:, 'dcoilwtico'] / oil.loc[:, 'benchmark'] * 100
oil.head()

        date  dcoilwtico  benchmark  benchmark ratio
0 2013-01-01         NaN         90              NaN
1 2013-01-02       93.14         90       103.488889
2 2013-01-03       92.97         90       103.300000
3 2013-01-04       93.12         90       103.466667
4 2013-01-07       93.20         90       103.555556

In [58]:
# ÎßàÏä§ÌÇπ
oil['buy'] = (oil.loc[:, 'benchmark ratio'] < 80) * (1000000 / oil.loc[:, 'dcoilwtico'])
oil.head()

        date  dcoilwtico  benchmark  benchmark ratio  buy
0 2013-01-01         NaN         90              NaN  NaN
1 2013-01-02       93.14         90       103.488889  0.0
2 2013-01-03       92.97         90       103.300000  0.0
3 2013-01-04       93.12         90       103.466667  0.0
4 2013-01-07       93.20         90       103.555556  0.0

### > select Î©îÏÑúÎìú
- ÎÑòÌååÏù¥ select Î©îÏÑúÎìú
    - create columns based on multiple conditions
- Ïπ¥ÌÖåÍ≥†Î¶¨Î≥Ñ Í∞í ÏßÄÏ†ï

In [59]:
oil = pd.read_csv('./data/retail/oil.csv')
oil.columns = ['date', 'price']
oil.head()

         date  price
0  2013-01-01    NaN
1  2013-01-02  93.14
2  2013-01-03  92.97
3  2013-01-04  93.12
4  2013-01-07  93.20

In [60]:
conditions = [
    (oil['price'] > 100),
    (oil['price'] <= 100) & (oil['price'] > 50),
    (oil['price'] <= 50)
]

choices = [
    "Don't Buy",
    "Buy",
    "Strong Buy"
]

oil['buy'] = np.select(conditions, choices, default='Missing')
oil

            date  price         buy
0     2013-01-01    NaN     Missing
1     2013-01-02  93.14         Buy
2     2013-01-03  92.97         Buy
3     2013-01-04  93.12         Buy
4     2013-01-07  93.20         Buy
...          ...    ...         ...
1213  2017-08-25  47.65  Strong Buy
1214  2017-08-28  46.40  Strong Buy
1215  2017-08-29  46.46  Strong Buy
1216  2017-08-30  45.96  Strong Buy
1217  2017-08-31  47.26  Strong Buy

[1218 rows x 3 columns]

## 9. map Î©îÏÑúÎìú
- maps values to a column
    1. ÎîïÏÖîÎÑàÎ¶¨ Ï†ÑÎã¨ (existing values as keys, new values as values)
    2. lambda Ìï®Ïàò (Ìè¨Îß∑ÌåÖ)

In [61]:
retail = pd.read_csv('./data/retail/retail_2016_2017.csv')

product_cat_dict = {
    'PRODUCE': 'Grocery',
    'POULTRY': 'Grocery',
    'Grocery I': 'Grocery',
    'Grocery II': 'Grocery',
    'EGGS': 'Grocery'
}

retail.loc[:, 'family'].map(product_cat_dict).value_counts(dropna=False)

NaN        959040
Grocery     95904
Name: family, dtype: int64

## 10. assign Î©îÏÑúÎìú
- creates multiple columns at once (returns Dataframe)
    - Ï≤¥Ïù¥Îãù Í∞ÄÎä•

In [62]:
retail.head(1)

        id        date  store_nbr      family  sales  onpromotion
0  1945944  2016-01-01          1  AUTOMOTIVE    0.0            0

In [63]:
(
    retail
    .assign(
    onpromotion_flag=retail['onpromotion'] > 0,
    family_abbrev=retail['family'].str[:3],
    onpromotion_ratio=retail['sales'] / retail['onpromotion'],
    sales_onprom_target=lambda x: x['onpromotion_ratio'] > 100)
    .query('sales_onprom_target == True')
)

,id,date,store_nbr,family,sales,onpromotion,onpromotion_flag,family_abbrev,onpromotion_ratio,sales_onprom_target
561,1946505,2016-01-01,25,AUTOMOTIVE,4.000,0,False,AUT,inf,True
563,1946507,2016-01-01,25,BEAUTY,13.000,0,False,BEA,inf,True
564,1946508,2016-01-01,25,BEVERAGES,5104.000,1,True,BEV,5104.000,True
566,1946510,2016-01-01,25,BREAD/BAKERY,680.952,0,False,BRE,inf,True
567,1946511,2016-01-01,25,CELEBRATION,13.000,0,False,CEL,inf,True
...,...,...,...,...,...,...,...,...,...,...
1054937,3000881,2017-08-15,9,PET SUPPLIES,6.000,0,False,PET,inf,True
1054938,3000882,2017-08-15,9,PLAYERS AND ELECTRONICS,6.000,0,False,PLA,inf,True
1054939,3000883,2017-08-15,9,POULTRY,438.133,0,False,POU,inf,True
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1,True,PRE,154.553,True
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0,False,SEA,inf,True

## 11. Data Types
### > ÌåêÎã§Ïä§ Îç∞Ïù¥ÌÑ∞ ÌÉÄÏûÖ
- pandas data-types expand on python/numpy
- Numeric
    1. boolean: nullable boolean True/False ‚Üí 8
    2. int64(default): nullable whole numbers ‚Üí 8, 16, 32, 64
    3. float64(default): nullable decimal numbers ‚Üí 32, 64
- Time Series
    1. datetime
    2. timedelta
    3. perod
### > categorical data type
- stores text data with repeated values efficiently
- use when (unique categories < number of rows / 2)

In [64]:
retail = pd.read_csv('./data/retail/retail_2016_2017.csv')
retail.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1054944 entries, 0 to 1054943
Data columns (total 6 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   id           1054944 non-null  int64
 1   date         1054944 non-null  object
 2   store_nbr    1054944 non-null  int64
 3   family       1054944 non-null  object
 4   sales        1054944 non-null  float64
 5   onpromotion  1054944 non-null  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 167.8 MB

In [65]:
retail['family'].value_counts()

AUTOMOTIVE                    31968
HOME APPLIANCES               31968
SCHOOL AND OFFICE SUPPLIES    31968
PRODUCE                       31968
PREPARED FOODS                31968
POULTRY                       31968
PLAYERS AND ELECTRONICS       31968
PET SUPPLIES                  31968
PERSONAL CARE                 31968
MEATS                         31968
MAGAZINES                     31968
LIQUOR,WINE,BEER              31968
LINGERIE                      31968
LAWN AND GARDEN               31968
LADIESWEAR                    31968
HOME CARE                     31968
HOME AND KITCHEN II           31968
BABY CARE                     31968
HOME AND KITCHEN I            31968
HARDWARE                      31968
GROCERY II                    31968
GROCERY I                     31968
FROZEN FOODS                  31968
EGGS                          31968
DELI                          31968
DAIRY                         31968
CLEANING                      31968
CELEBRATION                   31968
BREAD/BAKERY                  31968
BOOKS                         31968
BEVERAGES                     31968
BEAUTY                        31968
SEAFOOD                       31968
Name: family, dtype: int64

In [66]:
retail = retail.astype({'family': 'category'})
retail.dtypes

id                int64
date             object
store_nbr         int64
family         category
sales           float64
onpromotion       int64
dtype: object

In [67]:
retail.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1054944 entries, 0 to 1054943
Data columns (total 6 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   id           1054944 non-null  int64
 1   date         1054944 non-null  object
 2   store_nbr    1054944 non-null  int64
 3   family       1054944 non-null  category
 4   sales        1054944 non-null  float64
 5   onpromotion  1054944 non-null  int64
dtypes: category(1), float64(1), int64(3), object(1)
memory usage: 100.6 MB

### > Î©îÎ™®Î¶¨ ÏµúÏ†ÅÌôî ÏàúÏÑú
1. Î∂àÌïÑÏöîÌïú Ïª¨Îüº Ï†úÍ±∞ (when possible, avoid reading them in at all)
2. Îç∞Ïù¥ÌÑ∞ ÌÉÄÏûÖ Î≥ÄÌôò) object ‚Üí numeric ÎòêÎäî datetime (where possible)
3. Downcast numeric data to the smallest appropriate bit size
4. Use categorical datatype for columns where 'the number of unique values < (rows /2)'

- DataFrame.memory_usage(deep=True)

## üö© DataFrame Ï†ïÎ¶¨
1. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùÄ collections of Series
2. Exploration methods to take a glimpse of data and its characteristics
    - head, tail
    - describe, info
3. filter/sort/modify Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ
4. Memory optimization with large datasets